Who login to linux 

1. Команда w используется для получения списка залогиненных пользователей и выполняемых ими команд. 

Вывод команды w содержит следующие колонки:[cut]
Имя пользователя
Номер tty
Адрес, с которого произошло подключение
Время подключения
Время бездействия
Время, затраченное всеми процессами в данном сеансе (JCPU)
Время, потраченное текущим процессом (PCPU)
Команда, выполняемая пользователем
Дополнительно могут быть использованы следующие опции:

-h игнорировать информацию заголовка
-u отображать текущую загрузку
-s Удалить из вывода JCPU, PCPU, и время подключения


2. Команда who используется для получения списка пользователей, залогиненных в системе. 
В выводе находятся следующие колонки: имя пользователя, номер tty, дата и время, адрес подключения.

Для получения отсортированного списка используем команду:

$ <strong>who | cut -d’ ‘ -f1 | sort | uniq</strong>


3. Команда whoami сообщит вам информацию о том, под какой учетной записью вы залогинены в системе.

whoami дает такую же информацию, как и команда id -un

4. Смотрим историю подключений пользователя
Команда last покажет вам историю подключений для определенного пользователя. 
Если в качестве аргумента не указан логин какого либо пользователя, отобразится история для всех пользователей. 
Данная информация берется из файла /var/log/wtmp. 

В выводе присутствуют следующие колонки:

Имя пользователя
Номер Tty
Время и дата подключения
Время отключения
Общее время работы сеанса
